tutorials/oldd/Basic-Dynamic-Mesh-Tutorial-OpenFoam/TUT16/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    inlet
    {
        type            patch;
        nFaces          41;
        startFace       8193;
    }
    outlet
    {
        type            patch;
        nFaces          41;
        startFace       8234;
    }
    dymWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          73;
        startFace       8275;
    }
    AMI1
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          73;
        startFace       8348;
        matchTolerance  0.0001;
        transform       noOrdering;
        neighbourPatch  AMI2;
        method          faceAreaWeightAMI;
    }
    AMI2
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          162;
        startFace       8421;
        matchTolerance  0.0001;
        transform       noOrdering;
        neighbourPatch  AMI1;
        method          faceAreaWeightAMI;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          80;
        startFace       8583;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          4214;
        startFace       8663;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          4214;
        startFace       12877;
    }
)

// ************************************************************************* //
