tutorials/oldd/Basic-Dynamic-Mesh-Tutorial-OpenFoam/TUT16/system/probes.cfg
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

type            probes;
libs            ("libsampling.so");

writeControl    adjustableRunTime;//timeStep;
writeInterval   1;

// ************************************************************************* //
